{
  "greeting": "My way to the University of Latvia",
  "description": "During my time at the University of Latvia there have been many obstacles, memories and joys, but how did I get to this point?",
  "buttonText": "Time to find out!",
  "step1Title": "Choice",
  "step1Description": "How I came to choose to join the Faculty of Computer Science at the University of Latvia",
  "step2Title": "Route",
  "step2Description": "What interesting objects can be found on the way to the university",
  "step3Title": "Experience",
  "step3Description": "What has been the experience of going through the different courses",
  "step4Title": "Study materials",
  "step4Description": "What available resources were used and how useful were they",
  "welcome": "Welcome!",
  "navbar1": "My path to the University of Latvia",
  "navbar2": "The road to choice",
  "navbar3": "The road to LU DF",
  "navbar4": "Learning experience",
  "navbar5": "Study materials",
  "izveleTitle": "Path to the decision",
  "izveleSubTitle1": "Origins",
  "izveleSubTitle2": "Last year before University of Latvia",
  "izveleSubTitle3": "Final decision",
  "izveleSubText1": "Since I was very young, I have been interested in all things related to technology, especially computers. I used to spend my free time in front of the computer. Until secondary school, I didn't even think about where I would study next. It was only in high school that I started to plan my future. Until then, I automatically thought programming and nothing else was even close as an option. Whenever someone asked, the answer was always the same - I was going to be a programmer, even though at the time I didn't fully realize how it all worked.",
  "izveleSubText2":  "At the time, before I had to choose where to study, I was quite confused because everything happened very fast. I had to figure out in time where to try to get in, because there were entrance exams or a waiting list based on exam results, and there were a limited number of budget spots. It was also difficult from the point of view of people I knew, because there were divided opinions. Some chose Riga Technical University, others the University of Latvia or another university. In general, it was difficult to choose because each place had its pros and cons or other factors that pushed people in that direction.",
  "izveleSubText3":  "Once I passed my high school exams, I started to think more clearly about where to go. In the end, the choice was between Riga Technical University and the University of Latvia, in the field of computer science. In the end, I decided to try to get into the University of Latvia by applying for budget places. Initially I wondered whether I would get into the budget, but in the end I was in a pretty safe place after calculating my grades, which made me think that I would get in, and eventually I did. In the end, the choice was exclusively the University of Latvia, as the overall study description was more in line with my wishes and aspirations.",
  "izveleButton": "How do I get to LU DF?",
  "celsUzLuDfTitle": "Road to the University of Latvia",
  "celsUzLuDfSubTitle": "Objects of interest",
  "celsUzLuDfSubText1": "To get to the University of Latvia from where I live, there are 2 options, which are to go by bus or train. On each route there are different attractions that are worth highlighting, and these attractions are quite close when passing by them.",  
  "celsUzLuDfTrain": "Train route",
  "celsUzLuDfBus": "Bus route",
  "celsUzLuDfButton": "What has the experience been like at the University of Latvia?",
  "celsUzLuDfTrainTitle1": "Arcadia Park",
  "celsUzLuDfTrainText1": "Arcadia Park in Latvia is a captivating recreational destination set in the Latvian countryside. The park, through which the Marupite River flows, offers a quiet retreat for nature enthusiasts. The park also hosts cultural events and offers amenities such as picnic areas, sports grounds and cafés.",
  "celsUzLuDfTrainTitle2": "Pūpes Park",
  "celsUzLuDfTrainText2": "Pūpes Park is located in Babīte and is accessible to everyone. It has a variety of flowers and rhododendrons, as well as benches for relaxing. It is a pleasant park for walks and a great place for beautiful photos.",
  "celsUzLuDfTrainTitle3": "University of Latvia Academic Center for Natural Sciences",
  "celsUzLuDfTrainText3": "The University of Latvia Academic Center for Natural Sciences includes the faculties of physics, mathematics and optometry, as well as medicine. Its total area is 20 000 square metres.",  
  "celsUzLuDfBusTitle1": "National Library of Latvia",
  "celsUzLuDfBusText1": "The National Library of Latvia is a state cultural institution that provides universal access to a research library. Its main purpose is to build and preserve the national collection of literature. It also promotes higher education, research and lifelong learning, and is concerned with children's literacy and the promotion of reading.",  
  "celsUzLuDfBusTitle2": "Agenskalns Market",
  "celsUzLuDfBusText2": "One of the most popular markets in Riga, Latvia. It is located in the Agenskalns district, giving locals and visitors the opportunity to shop for a variety of food products, fresh vegetables, fruit, fish, meat, bread and other daily necessities. It is known for its freshness, wide range of products and friendly atmosphere.",
  "celsUzLuDfBusTitle3": "The Botanical Garden of the University of Latvia",
  "celsUzLuDfBusText3": "The Botanical Garden is located in Riga and is part of the Faculty of Biology at the University of Latvia. It covers 17 hectares and has more than 6000 plant species. Educational activities such as excursions, lectures, etc. are often held there",  
  "macibuPieredzeTitle": "Studying experience",
  "macibuPieredzeSubTitle": "Experience in various courses",
  "macibuPieredzeSubText": "While studying at the University of Latvia, I have taken many different courses, almost all of which have left some kind of impression of their complexity, interest or usefulness. Looking back at all the courses I have done, they can be mostly categorised in one way or another, but there were a few that stood out and I wanted to share them and explain why they were categorised in that way.",
  "macibuPieredzeBoxText1": "Courses where complexities arose and significantly more focus was needed",
  "macibuPieredzeBoxText2": "Courses that generated interest and stood out among others",
  "macibuPieredzeBoxText3": "Courses that could be most useful in the future",
  "macibuPieredzeBoxButton1": "The most difficult courses",
  "macibuPieredzeBoxButton2": "Most interesting courses",
  "macibuPieredzeBoxButton3": "Most useful courses",
  "kursiGrutTitle": "The most difficult courses",
  "kursiGrutBoxTitle1": "Analytical Geometry",
  "kursiGrutBoxText1": "From my school days, geometry was neither my strong point nor my interest, and in general it was always the part of maths I disliked the most. Analytical geometry included everything I had to learn at school, only made more complicated and with higher level requirements. I had to deal again with vectors, planes, curves, different surfaces, etc. On the good side, the problems were designed in such a way that software could be developed to calculate them. Of course, the focus of the course was on the problems themselves and the software did not have to be made. Overall, the complexity of the course was due to a dislike of geometry",  
  "kursiGrutBoxTitle2": "Computer networks and insight into industry",
  "kursiGrutBoxText2": "The Computer Networks and Industry Insights course was already in the first semester and was relatively closely related to programming, which made me think it would be both useful and interesting. However, the scope of the course was unexpected, especially for a first university experience. In order to pass the course, you had to complete small tests, laboratory work and an exam which consisted of 2 parts - written and oral. The most difficult part was the oral exam, where 18 topics were given and one would be drawn out, and the narration was made difficult by the lecturer's demands to move away from the desk, turn on the camera and speak with eyes closed",  
  "kursiGrutBoxTitle3": "Databases",
  "kursiGrutBoxText3": "This course itself was not difficult in terms of the tasks, but the size of the course and the disagreement with the lecturer made it very difficult. There were 2 parts to the course - Databases and Information Systems, where different things had to be done in each part. In general, each part had a written exam, a final practical work, big and small tests. The disagreement with the lecturer was in the Database part, where initially there were certain conditions to pass the course, but suddenly towards the end the lecturer decided to change them, when the corresponding decisions to pass the course were made long before. In particular, optional tests were made compulsory, which caused problems with the success of a large number of colleagues",  
  "kursiGrutButtonTitle": "Materials used",
  "kursiGrutMaterialiText": "What resources were used to cope with the necessary problems encountered during the courses",
  "kursiInterTitle": "Most interesting courses",
  "kursiInterBoxTitle1": "Operating systems",
  "kursiInterBoxText1": "This course was interesting because it was based on the title - operating systems. Any person using any kind of device comes into contact with it. During the course, the operating systems had to be used virtually and changes had to be made to it as required. There were tasks with the usual Windows operating system as well as Linux, with which there was no previous experience. In addition, there was also an insight into the security of operating systems, and there was an insight not only into operating systems but also into their servers, which I had not encountered before. Overall, I gained knowledge about the different features of operating systems that I did not know before, and it was interesting to do all the practical work.",
  "kursiInterBoxTitle2": "Practice",
  "kursiInterBoxText2": "There are probably no questions about why this course might be interesting. During the Practice course, there were a lot of new things and a lot of different tasks, all in a relatively new environment. With each task the complexity increased and the interest didn't disappear as each time there were significantly different tasks to complete. The internship also made me want to continue programming in that direction, as what I had done was only a small part of what was possible",  
  "kursiInterBoxTitle3": "Introduction to management",
  "kursiInterBoxText3": "This course gave a very good insight into entrepreneurship and was interesting in all the factors mentioned about promoting entrepreneurship, but also in, so to speak, stimulating the creation and maintenance of an business. There were also various researches to be done, such as surveys, and relevant researches to be able to analyze and present the information gathered. All in all, this course would be enough for a person to be able to start their own business",  
  "kursiInterButtonTitle": "Materials used",
  "kursiInterMaterialiText": "What resources were used to cope with the necessary problems encountered during the courses",
  "kursiNoderTitle": "The most useful courses",
  "kursiNoderBoxTitle1": "Software Engineering",
  "kursiNoderBoxText1": "The Software Engineering course was quite useful, both in terms of quality software development and in terms of preparing for the qualification project. The course covered the development of a SRS, or software requirements specification, as well as the study of related topics. In any system, the SRS helps to understand the meaning of the system more clearly and helps to facilitate its understanding. Software engineering also prepared for writing the qualification project, where the SRS of the system had to be developed. Overall, it is safe to assume that this course will also be useful in the future.",  
  "kursiNoderBoxTitle2": "Internet, Netiquette And The Legal Regulation",
  "kursiNoderBoxText2": "This course provided knowledge on how to use the Internet. The idea seems obvious, but until you look deeper into it, the level of knowledge will only be superficial. The etiquette and legal framework for use were covered, as well as the safe use of the Internet, which includes the responsibility of the individual to use their own information safely. The course also covered the creation of necessary documents, such as CVs, which will definitely be useful for everyone. The course concluded with a talk on e-signatures, which allow documents to be signed electronically, making it easier to prove one's identity.",
  "kursiNoderBoxTitle3": "Practice",
  "kursiNoderBoxText3": "This course could definitely be considered the most important of all, as it gives you real experience in a workplace. Any person who goes to university does so to be able to get better quality job opportunities. This course, which lasted a total of 2 semesters, initially covered the general principles of workplaces and prepared students for the job. In the workplace itself, many skills were acquired which developed the skills of developing a specific direction. This is a course I would recommend anyone to take",  
  "kursiNoderButtonTitle": "Materials used",
  "kursiNoderMaterialiText": "What resources were used to deal with the necessary problems encountered during the courses",
  "macibuMaterialiTitle": "Study materials",
  "macibuMaterialiSubTitle1": "E-studijas.lu.lv materials",
  "macibuMaterialiSubText1": "The most used and accessible type of materials were of course the range of materials available in e-studies site, with the appropriate information selected for each course. The site contained materials chosen by the lecturers and other involved people, either of their own creation or a selection of high quality public materials by others. These were also the most used, as the examples given were more similar to what could be found in all kinds of tasks. They were not only the most used, but also the most useful, for the reason mentioned above.",
  "macibuMaterialiSubTitle2": "Documentation of programs and other tools",
  "macibuMaterialiSubText2": "During my studies I also had to use all kinds of software, apps and libraries and all these things have appropriate documentation that the user can follow to achieve the desired result. Some of the material used in e-studies site is also based on the relevant documentation. Compared to the materials available in e-studies, the documentation is somewhat more difficult to follow, as it contains a very wide range of descriptive information. On the other hand, the e-studies site has more specific examples of what is being studied at the given time and also more clearly described examples of use, as the documentation is generalized",
  "macibuMaterialiSubTitle3": "Results from search engines",
  "macibuMaterialiSubText3": "Search engines and other similar tools were also very widely used. There were times when e-studies did not provide the needed information or there were other ways to find out certain information. Of course, search engines also made it easier to get the information faster, because you could find what you needed without having to go through all the e-studies materials or documentation, but by searching for exactly what you needed. "
}