{
  "greeting": "Mans ceļš uz Latvijas Universitāti",
  "description": "Pavadītajā laikā Latvijas Universitātē ir bijuši vairāki šķēršļi, atmiņas un prieki, bet kā es nonācu līdz šim?",
  "buttonText": "Laiks uzzināt!",
  "step1Title": "Izvēle",
  "step1Description": "Kā es nonācu līdz izvēlei iestāties Latvijas Universitātes datorikas fakultātē",
  "step2Title": "Maršruts",
  "step2Description": "Kādi interesanti objekti ir sastopami pa ceļam uz universitāti",
  "step3Title": "Pieredze",
  "step3Description": "Kāda ir bijusi pieredze ejot cauri dažādajiem kursiem",
  "step4Title": "Mācību materiāli",
  "step4Description": "Kādi pieejamie resursi tika izmantoti un cik tie bija noderīgi",
  "welcome": "Laipni lūdzam!",
  "navbar1": "Mans ceļš uz Latvijas Universitāti",
  "navbar2": "Ceļš līdz izvēlei",
  "navbar3": "Ceļš uz LU DF",
  "navbar4": "Mācību pieredze",
  "navbar5": "Mācību materiāli",
  "izveleTitle": "Ceļš līdz izvēlei",
  "izveleSubTitle1": "Pirmsākumi",
  "izveleSubTitle2": "Pēdējais gads pirms Latvijas Universitātes",
  "izveleSubTitle3": "Gala izvēle",
  "izveleSubText1": "Jau no agra vecuma es esmu bijis ieinteresēts visā, kas saistās ar tehnoloģijām, īpaši ar datoriem. Brīvo laiku mēdzu pavadīt pie datora. Līdz vidusskolai pat neapdomāju, kur tālāk mācītos. Tikai vidusskolā sāku plānot savu nākotni. Līdz tam automātiski bija doma, ka programmēšanu un nekas cits pat tuvu nebija kā opcija. Vienmēr kad kāds bija jautājis, atbilde ir bijusi viena - būšu programmētājs, lai gan tolaik līdz galam neapzinājos kā tas viss norit.",
  "izveleSubText2": "Laikā pirms bija jāveic izvēle kur iestāties, biju visai apjucis, jo viss notika ļoti strauji. Laicīgi vajadzēja izdomāt, kur mēģināt iestāties, jo vietām bija iestājeksāmeni vai arī rinda pēc eksāmenu rezultātiem, kā arī bija ierobežots budžeta vietu skaits. Grūti arī bija no paziņu skatapunkta, jo bija sadalīti viedokļi. Daļa izvēlējās Rīgas Tehnisko Universitāti, daļa Latvijas Universitāti vai kādu citu universitāti. Kopumā, bija grūti izvēlēties, jo katrai studiju vietai bija savi plusi un mīnusi vai citi faktori, kas virzīja uz atbilstošo pusi.",
  "izveleSubText3": "Kad vidusskolas eksāmeni bija nokārtoti, sāku skaidrāk apdomāt kur stāties. Beigās izvēle bija starp Rīgas Tehnisko Universitāti un Latvijas Universitāti, virzienā datorzinātnes. Galu galā paliku pie izvēles censties iestāties Latvijas Universitātē, piesakoties budžeta vietām. Sākotnēji domāju, vai iekļūšu budžetā, taču beigās pēc rēķinātās atzīmes biju visai drošā vietā, kas lika domāt, ka tikšu un galu galā arī tiku. Uz pašām beigām izvēle bija tikai un vienīgi Latvijas Universitāte, jo kopumā studiju apraksts bija vairāk atbilstošs manām vēlmēm un iecerēm",
  "izveleButton": "Kā es nokļūstu līdz LU DF?",
  "celsUzLuDfTitle": "Ceļš uz Latvijas Universitāti",
  "celsUzLuDfSubTitle": "Sastopamie objekti",
  "celsUzLuDfSubText1": "Lai no dzīvesvietas nokļūtu uz Latvijas Universitāti ir 2 varianti, kas ir brauciens ar autobusu vai vilcienu. Katrā maršrutā ir sastopami dažādi objekti, kurus ir vērts izcelt, kā arī šie objekti atrodas visai tuvu, braucot tām garām.",
  "celsUzLuDfTrain": "Vilciena maršruts",
  "celsUzLuDfBus": "Autobusa maršruts",
  "celsUzLuDfButton": "Kāda ir bijusi pieredze Latvijas Universitātē?",
  "celsUzLuDfTrainTitle1": "Arkādijas parks",
  "celsUzLuDfTrainText1": "Arkādijas parks Latvijā ir valdzinošs atpūtas galamērķis, kas atrodas Latvijas lauku ainavā. Parks, caur kuru plūst Mārupīte, piedāvā klusu atpūtu dabas entuziastiem. Parkā tiek rīkoti arī kultūras pasākumi un ir pieejamas tādas ērtības kā piknika vietas, sporta laukumi un kafejnīcas.",
  "celsUzLuDfTrainTitle2": "Pūpes parks",
  "celsUzLuDfTrainText2": "Pūpes parks atrodas Babītē un tas ir pieejams ikvienam. Tajā zied dažādas puķes un rododendri, kā arī ir soliņi atpūtai. Tas ir patīkams parks pastaigām, kā arī ir lieliska vieta skaistām fotogrāfijām.",
  "celsUzLuDfTrainTitle3": "Zinātņu māja, LU Akadēmiskais centrs",
  "celsUzLuDfTrainText3": "Latvijas Universitātes Zinātņu māja ietver fizikas, matemātikas un optometrijas, kā arī medicīnas fakultātes. Tās kopējā platība sasniedz 20 000 kvadrātmetru.",
  "celsUzLuDfBusTitle1": "Latvijas Nacionālā bibliotēka",
  "celsUzLuDfBusText1": "Latvijas Nacionālā bibliotēka ir valsts kultūras institūcija, kas nodrošina vispārēju piekļuvi zinātniskai bibliotēkai. Tās galvenais mērķis ir veidot un saglabāt nacionālo literatūras krājumu. Bibliotēka arī veicina augstāko izglītību, pētniecību un mūžīgu izglītību, kā arī rūpējas par bērnu lasītprasmi un lasīšanas veicināšanu.",
  "celsUzLuDfBusTitle2": "Āgenskalna tirgus",
  "celsUzLuDfBusText2": "Āgenskalna Tirgus ir viena no iecienītākajām tirgus vietām Rīgā, Latvijā. Tas atrodas Āgenskalna rajonā, sniedzot vietējiem iedzīvotājiem un apmeklētājiem iespēju iepirkties dažādos pārtikas produktos, svaigus dārzeņus, augļus, zivis, gaļu, maizi un citus ikdienas nepieciešamības produktus. Āgenskalna Tirgus ir pazīstams ar savu svaigumu, plašo produktu klāstu un draudzīgo atmosfēru.",
  "celsUzLuDfBusTitle3": "Botāniskais dārzs",
  "celsUzLuDfBusText3": "Botāniskais dārzs atrodas Rīgā un ir daļa no Latvijas Universitātes bioloģijas fakultātes. Tas aizņem 17 hektārus un tajā ir vairāk nekā 6000 augu sugas. Tur bieži notiek izglītojošas aktivitātes kā ekskursijas, lekcijas u.c.",
  "macibuPieredzeTitle": "Mācību pieredze",
  "macibuPieredzeSubTitle": "Pieredze dažādos kursos",
  "macibuPieredzeSubText": "Mācoties Latvijas Universitātē ir bijuši daudz dažādi kursi, no kuriem praktiski katrs atstāja kaut kāda veida iespaidu par tā sarežģītību, interesi vai noderību. Atskatoties uz visiem bijušajiem kursiem, tos lielākoties var iedalīt kāda no kategorijām, taču attiecīgajās kategorijās bija daži kursi, kas īpaši izcēlās un ar tiem es vēlējos padalīties, ka arī paskaidrot iemeslus, kāpēc tie ir iedalīti šādi.",
  "macibuPieredzeBoxText1": "Kursi, kuros radās sarežģītības un vajadzēja ievērojami vairāk pievērsties",
  "macibuPieredzeBoxText2": "Kursi, kuri radīja interesi un izcēlās citu starpā",
  "macibuPieredzeBoxText3": "Kursi, kuri visvairāk varētu noderēt nākotnē",
  "macibuPieredzeBoxButton1": "Sarežģītākie kursi",
  "macibuPieredzeBoxButton2": "Interesantākie kursi",
  "macibuPieredzeBoxButton3": "Noderīgākie kursi",
  "kursiGrutTitle": "Sarežģītākie kursi",
  "kursiGrutBoxTitle1": "Analītiskā ģeometrija",
  "kursiGrutBoxText1": "Jau no skolas laikiem, ģeometrija nebija ne mana stiprā puse, ne interesējoša un kopumā vienmēr bija tā matemātikas daļa, kas visvairāk nepatika. Analītiskajā ģeometrijā pagadījās viss, ko skolā bija jāmācās, tikai padarīts daudz sarežģītāks un prasības jāizpilda augstākā līmenī. Nācās atkal sastapties ar vektoriem, plaknēm, līknēm, dažādām virsmām u.c. No labās puses, uzdevumi bija paredzēti tāda veida, lai tiem varētu izveidot programmatūru, ar ko tos var aprēķināt. Protams, kursa laikā fokuss bija uz pašiem uzdevumiem un programmatūra nebija jātaisa. Kopumā, kursa sarežģītību veidoja nepatika pret ģeometriju.",
  "kursiGrutBoxTitle2": "Datoru tīkli un ieskats nozarē",
  "kursiGrutBoxText2": "Kurss Datoru tīkli un ieskats nozarē bija jau pirmajā studiju semestrī, kā arī salīdzinoši tuvu saistījās ar programmēšanas virzienu, kas lika domāt, ka tas būs gan noderīgi, gan interesanti. Tomēr, kursa apjoms bija negaidīts, īpaši priekš pirmās pieredzes universitātē. Lai nokārtotu kursu bija jāizpilda nelieli kontroldarbi, veiksmīgi jāizpilda laboratorijas darbi, kā arī sekmīgi nokārtots eksāmens, kas sastāvēja 2 daļās - rakstiskajā un mutiskajā. Pati sarežģītākā daļa bija mutiskajā eksāmenā, kur tika dotas 18 tēmas, no kurām tiks izvilkta viena, kā arī stāstījumu apgrūtināja pasniedzēja prasības atbīdīties no galda, ieslēgt kameru un runāt ar acīm ciet.",
  "kursiGrutBoxTitle3": "Datu bāzes",
  "kursiGrutBoxText3": "Šis kurss pats par sevi nebija sarežģīts, ja skatās uz lietām, kas jāveic, taču šī kursa apjoms un nesaskaņas ar pasniedzēju to ļoti apgrūtināja. Kursa laikā bija 2 daļas - Datu bāzes un Informāciju sistēmas, kur katrā daļā bija jādara atšķirīgas lietas. Kopumā, katrā daļā bija rakstisks eksāmens, gala praktiskais darbs, kontroldarbi, kā arī nelieli testi. Nesaskaņas ar pasniedzēju izpaudās tieši Datu bāzes daļā, kur sākotnēji bija izteikti vieni nosacījumi, lai nokārtotu kursu, taču pēkšņi uz beigām pasniedzējs izdomāja tos izmainīt, kad atbilstošas izveiktes, lai nokārtotu kursu tika veiktas sen iepriekš. Konkrēti - neobligāti testi tika padarīti par obligātiem, kā dēļ lielai daļai kolēģu radās problēmas ar sekmību.",
  "kursiGrutButtonTitle": "Izmantotie materiāli",
  "kursiGrutMaterialiText": "Kādi resursi tika izmantoti, lai tiktu galā ar nepieciešamajām problēmām, ar kurām nācās saskarties kursu ietvaros",
  "kursiInterTitle": "Interesantākie kursi",
  "kursiInterBoxTitle1": "Operētājsistēmas",
  "kursiInterBoxText1": "Šis kurss bija interesants, jo tas balstījās uz nosaukumā minēto - operētājsistēmām. Ar to saskaras jebkura persona, kas lieto jebkāda veida ierīces. Kursa laikā bija virtuāli jāizmanto kada operētājsistēma un tajā bija jāveic izmaiņas, atbilstoši prasītajam. Bija jādarbojas gan ierastajā Windows, gan arī Linux operētājsistēmā, ar ko pieredze iepriekš nebija. Papildu, bija arī ieskats operētājsistēmu drošībā, kā arī bija ieskats ne tikai operētājsistēmās, bet arī to serveros, ar ko iepriekš arī nebiju saskāries. Kopumā, tika iegūtas zināšanas par dažādām operētājsistēmu iespējām, ko iepriekš nepratu, kā arī bija interesanti veikt visus praktiskos darbus.",
  "kursiInterBoxTitle2": "Prakse",
  "kursiInterBoxText2": "Iespējams, par šo kursu nav jautājumu, kāpēc tas varētu būt interesants. Kursa Prakse laikā tika darītas pavisam jaunas lietas un veikti daudz dažādi uzdevumi, kas viss notika arī salīdzinoši jaunā vidē. Ar katru uzdevumu sarežģītīa paaugstinājās un interese nepazuda, jo katru reizi bija jāveic būtiski atšķirīgāki uzdevumi. Atbilstošā prakses vieta arī radīja interesi turpināt programmēt attiecīgajā virzienā, jo paveiktais bija tikai maza daļa no visa iespējamā.",
  "kursiInterBoxTitle3": "Ievads uzņēmējdarbībā",
  "kursiInterBoxText3": "Šajā kursā bija ļoti labs ieskats uzņēmējdarbībā un interesi radīja gan visi minētie faktori par uzņēmuma darbību veicināšanu, gan arī bija tā teikt jāsimulē uzņēmuma izveide un uzturēšana. Bija arī jāveic dažādi pētījumi, kā piemēram aptaujas, kā arī atbilstošie pētījumi bija jāspēj analizēt un pasniegt apkopoto informāciju. Kopumā, ar šo kursu pietiktu, lai cilvēks būtu spējīgs uzsākt savu uzņēmumu.",
  "kursiInterButtonTitle": "Izmantotie materiāli",
  "kursiInterMaterialiText": "Kādi resursi tika izmantoti, lai tiktu galā ar nepieciešamajām problēmām, ar kurām nācās saskarties kursu ietvaros",
  "kursiNoderTitle": "Noderīgākie kursi",
  "kursiNoderBoxTitle1": "Programminženierija",
  "kursiNoderBoxText1": "Kurss Programminženierija bija visai noderīgs gan programmatūras kvalitatīvas izstrādes ziņā, gan kvalifikācijas darba sagataves ziņā. Kursa laikā tika apgūta PPS jeb programmatūras prasību specifikācijas izstrādes veikšana, kā arī to saistošo tēmu izpēte. Jebkurā sistēmā PPS palīdz skaidrāk izprast tās būtību un palīdz atvieglot tas izpratni. Programminženierija arī sagatavoja kvalifikācijas darba rakstīšanai, kur tieši bija jāizstrādā sistēma un sistēmas PPS.Kopumā, var mierīgi uzskatīt, ka nākotnē šis kurss arī būs noderējis.",
  "kursiNoderBoxTitle2": "Internets, tīkla etiķete un tiesiskais regulējums",
  "kursiNoderBoxText2": "Šajā kursā tika iegūtas zināšanas par interneta lietošanu. Pēc idejas, tas šķiet pašsaprotami, taču kamēr tajā neieskatās dziļāk, zināšanu līmenis būs tikai virspusējs. Tika apskatīta lietošanas etiķete un normatīvais regulējums, kā arī interneta droša lietošana, kas ietver arī personas atbildību par savas informācijas drošu izmantošanu. Kursa laikā tika arī stāstīts par nepieciešamo dokumentu izveidi, kā piemēram CV, kas pavisam noteikti noderēs ikvienam. Kursa nobeigumā tika stāstīts par e-parakstu, ar kā palīdzību elektroniski var parakstīt dokumentus, kas kopumā atvieglo identitātes apliecināšanu.",
  "kursiNoderBoxTitle3": "Prakse",
  "kursiNoderBoxText3": "Šis kurss viennozīmīgi varētu tikts uzskatīts par pašu nozīmīgako no visiem, jo tas dod reālu pieredzi kādā darba vietā. Jebkura persona, kas mācās universitātē, to dara, lai varētu iegūt kvalitatīvākas darba vietas iespējas. Šī kursa laikā, kas kopā ilga 2 semestrus, sākotnēji tika pastāstīts par vispārīgiem principiem darba vietās un studentus sagatavoja darbam. Pašā darba vietā tika gūtas daudz iemaņas, kas attīstīja konkrētā virziena izstrādes prasmes. Šis ir kurss, kuru ieteiktu ikvienam veikt.",
  "kursiNoderButtonTitle": "Izmantotie materiāli",
  "kursiNoderMaterialiText": "Kādi resursi tika izmantoti, lai tiktu galā ar nepieciešamajām problēmām, ar kurām nācās saskarties kursu ietvaros",
  "macibuMaterialiTitle": "Mācību materiāli",
  "macibuMaterialiSubTitle1": "E-studijās pieejamie materiāli",
  "macibuMaterialiSubText1": "Pats izmantotākais un pieejamākais materiālu veids protams bija e-studiju pieejamais materiālu klāsts, katram kursam atbilstoši izvēlētā informācija. Vietnē bija pasniedzēju un citu iesaistīto vadītāju izvēlētie materiāli, vai nu pašu veidoti, vai arī izvēlēti kvalitatīvi citu personu publiski materiāli. Šos materiālus arī visvairāk sanāca izmantot, jo arī dotie piemēri bija līdzīgāki tam, ko varēja sastapt visāda veida darbos. Tie bija ne tikai visvairāk izmantoti, bet arī visnoderīgākie, iepriekš minētā iemesla dēļ. ",
  "macibuMaterialiSubTitle2": "Programmu un citu rīku dokumentācija",
  "macibuMaterialiSubText2": "Studiju laikā bija arī jālieto visāda veida programmatūra, lietotnes un saistošās bibliotēkas un visām minētajām lietām ir atbilstoša dokumentācija, pēc kuras tās lietotājs var vadīties, lai panāktu vēlamo rezultātu. Arī daļa e-studijās izmantoto materiālu arī ir veidota balstoties uz atbilstošo dokumentāciju. Salīdzinoši ar e-studijās pieejamajiem materiāliem, dokumentācijā ir nedaudz grūtāk vadīties, jo tajā ir ļoti plaša veida aprakstīta informācija. No otras puses, e-studiju vietnē ir konkrētāki piemēri tam, uz ko dotajā laikā mācās un arī ir skaidrāk aprakstīti lietošanas piemēri, jo dokumentācijā visa informācija ir vispārīga.",
  "macibuMaterialiSubTitle3": "Meklētājprogrammu dotie rezultāti",
  "macibuMaterialiSubText3": "Vēl ļoti plaši izmantotas bija meklētājprogrammas un citi līdzīga veida rīki. Mēdza gadīties situācijas, kad e-studijās nebija pieejama tāda informācija, kā vēlētos vai arī bija vēl citi veidi kā kādu konkrētu informāciju izzināt. Protams, ar meklētājprogrammām bija arī vienkāršāk iegūt informāciju ātrāk, jo konkrēto nepieciešamo lietu varēja atrast neejot cauri visiem e-studiju vai dokumentāciju materiāliem, bet gan meklējot to, ko vajag. "
}